app/controllers/short_urls_controller.rb

SELECT `short_urls`.* FROM `short_urls`
---
  def index
    urls = ShortUrl.all

INSERT INTO `short_urls` (`full_url`, `created_at`, `updated_at`) VALUES ('https://www.test.rspec', '2022-04-26 03:37:50.351883', '2022-04-26 03:37:50.351883')
---
  def create
    url = ShortUrl.new(url_params)
    if url.valid?
      url.save

UPDATE `short_urls` SET `short_urls`.`click_count` = 1, `short_urls`.`updated_at` = '2022-04-26 03:37:50.384136' WHERE `short_urls`.`id` = 4
---
  def show
    url = ShortUrl.find_by_short_code(params[:id])
    url.update(click_count: url.click_count + 1) unless url.nil?